# GNU coreutils #https://apple.stackexchange.com/questions/69223/how-to-replace-mac-os-x-utilities-with-gnu-core-utilities
brew "coreutils"
brew "findutils"
brew "gnu-indent"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnutls"
brew "grep"
brew "gnu-tar"
brew "gawk"
brew "watchman"

# Binaries
brew "bat"
brew "diff-so-fancy"
brew "exa"
brew "fzf"
brew "hub"
brew "htop"
brew "imagemagick"
brew "git"
brew "git-lfs"
brew "mas"
brew "m-cli"
brew "tig"
brew "thefuck"
brew "tldr"
brew "zsh"


brew "getantibody/tap/antibody"

tap 'homebrew/cask-fonts'

# JS development
# brew "nvm"
brew "yarn"

# Fonts
# https://github.com/Homebrew/homebrew-cask-fonts/blob/master/Casks/font-dejavusansmono-nerd-font.rb
cask "font-dejavu-sans-mono-nerd-font"

# Apps
cask "bartender"
cask "docker"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "imageoptim"
cask "insomnia"
cask "iterm2"
cask "postman"
cask "slack"
cask "spectacle"
cask "spotify"
cask "sublime-text"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
# cask "sketch"
# TODO: add alfred
# TODO: check mackup https://github.com/lra/mackup

# AppStore Apps
# mas "1Password 7", id: 1333542190
# mas "Slack", id: 803453959 # prefer brew cask formula since it doesn't require appstore login
# mas "Spark", id: 1176895641
# mas "Todoist", id: 585829637
# mas "ToothFairy", id: 1191449274
# mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
