tap 'caskroom/fonts'

# GNU coreutils #https://apple.stackexchange.com/questions/69223/how-to-replace-mac-os-x-utilities-with-gnu-core-utilities
brew "coreutils"
brew "findutils"
brew "gnu-indent"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnutls"
brew "grep"
brew "gnu-tar"
brew "gawk"

# Binaries
brew "bat"
brew "exa"
brew "hub"
brew "htop"
brew "git"
brew "git-lfs"
brew "mas"
brew "m-cli"
brew "thefuck"
brew "tldr"
brew "zsh"
brew "getantibody/tap/antibody"

# Fonts
# https://github.com/Homebrew/homebrew-cask-fonts/blob/master/Casks/font-dejavusansmono-nerd-font.rb
cask "font-dejavusansmono-nerd-font"

# Apps
cask "adobe-creative-cloud" # just downloads installer
cask "bartender"
cask "dropbox"
cask "fantastical"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "imageoptim"
cask "iterm2"
cask "kindle"
cask "notion"
cask "sketch"
cask "skype"
cask "spotify"
cask "spectacle"
cask "sublime-text"
cask "visual-studio-code"
cask "vlc"
# TODO: add alfred
# TODO: check mackup https://github.com/lra/mackup

# AppStore Apps
mas "1Password 7", id: 1333542190
mas "Bear", id: 1091189122
# mas "Fantastical 2", id: 975937182 # TODO: didn't purchase from the appstore
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Todoist", id: 585829637
mas "ToothFairy", id: 1191449274
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
