# Binaries
brew "git"
brew "mas"

# Apps
cask "bartender"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "notion"
cask "spotify"
cask "spectacle"
cask "visual-studio-code"
cask "vlc"

# AppStore Apps
mas "1Password 7", id: 1333542190
mas "Bear", id: 1091189122
mas "Fantastical 2", id: 975937182
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Todoist", id: 585829637
mas "ToothFairy", id: 1191449274
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
