alefragnani.bookmarks
alexdima.copy-relative-path
anthropic.claude-code
anysphere.cursorpyright
anysphere.pyright
codezombiech.gitignore
cschlosser.doxdocgen
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
dbankier.vscode-quick-select
divlo.vscode-styled-jsx-languageserver
drknoxy.eslint-disable-snippets
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
formulahendry.auto-rename-tag
foxundermoon.next-js
graphql.vscode-graphql
graphql.vscode-graphql-syntax
jeff-hykin.better-cpp-syntax
kaiwood.better-line-select
kisstkondoros.vscode-gutter-preview
mikestead.dotenv
mrmlnc.vscode-json5
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.sublime-keybindings
ms-vscode.vscode-js-profile-flame
oderwat.indent-rainbow
patbenatar.advanced-new-file
prisma.prisma
redhat.vscode-yaml
shardulm94.trailing-spaces
sidneys1.gitconfig
sleistner.vscode-fileutils
slevesque.shader
stkb.rewrap
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
techer.open-in-browser
tomoki1207.pdf
twxs.cmake
ue.alphabetical-sorter
unifiedjs.vscode-mdx
vincaslt.highlight-matching-tag
vscode-icons-team.vscode-icons
wayou.vscode-todo-highlight
yzhang.markdown-all-in-one
zignd.html-css-class-completion
