alefragnani.bookmarks
alefragnani.project-manager
alexdima.copy-relative-path
cduruk.thrift
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
codezombiech.gitignore
cschlosser.doxdocgen
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
dbankier.vscode-quick-select
dracula-theme.theme-dracula
drknoxy.eslint-disable-snippets
dsznajder.es7-react-js-snippets
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
formulahendry.auto-rename-tag
gerane.theme-tomorrownighteighties
github.copilot
github.copilot-chat
graphql.vscode-graphql
graphql.vscode-graphql-execution
graphql.vscode-graphql-syntax
jeff-hykin.better-cpp-syntax
kaiwood.better-line-select
kisstkondoros.vscode-gutter-preview
lihui.vs-color-picker
mrmlnc.vscode-json5
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.sublime-keybindings
naumovs.color-highlight
npclaudiu.vscode-gn
oderwat.indent-rainbow
omthemes.omthemes
patbenatar.advanced-new-file
prisma.prisma
ronba.vscode-rive-viewer
shardulm94.trailing-spaces
sidneys1.gitconfig
sleistner.vscode-fileutils
slevesque.shader
styled-components.vscode-styled-components
techer.open-in-browser
tomoki1207.pdf
twxs.cmake
ue.alphabetical-sorter
vincaslt.highlight-matching-tag
vscode-icons-team.vscode-icons
wayou.vscode-todo-highlight
xabikos.reactsnippets
yzhang.markdown-all-in-one
zignd.html-css-class-completion
