alefragnani.Bookmarks
alefragnani.project-manager
alexdima.copy-relative-path
cduruk.thrift
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
codezombiech.gitignore
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
dbankier.vscode-quick-select
DLS.vscode-stylelint-0-87-6
dracula-theme.theme-dracula
drKnoxy.eslint-disable-snippets
dsznajder.es7-react-js-snippets
eamodio.gitlens
eamodio.restore-editors
EditorConfig.EditorConfig
esbenp.prettier-vscode
formulahendry.auto-rename-tag
GitHub.copilot
GraphQL.vscode-graphql
IBM.output-colorizer
kaiwood.better-line-select
kisstkondoros.vscode-gutter-preview
kumar-harsh.graphql-for-vscode
lihui.vs-color-picker
mgmcdermott.vscode-language-babel
mkaufman.HTMLHint
mrmlnc.vscode-json5
ms-azuretools.vscode-docker
ms-vscode.sublime-keybindings
naumovs.color-highlight
oderwat.indent-rainbow
omthemes.omthemes
patbenatar.advanced-new-file
Prisma.prisma
redhat.vscode-yaml
sdras.night-owl
shardulm94.trailing-spaces
sidneys1.gitconfig
SirTori.indenticator
sleistner.vscode-fileutils
slevesque.shader
styled-components.vscode-styled-components
stylelint.vscode-stylelint
techer.open-in-browser
tomoki1207.pdf
ue.alphabetical-sorter
vincaslt.highlight-matching-tag
vscode-icons-team.vscode-icons
wayou.vscode-todo-highlight
xabikos.ReactSnippets
yzhang.markdown-all-in-one
