alefragnani.Bookmarks
alefragnani.project-manager
alexdima.copy-relative-path
AndrsDC.base16-themes
bierner.lit-html
blanu.vscode-styled-jsx
cduruk.thrift
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
codezombiech.gitignore
CoenraadS.bracket-pair-colorizer-2
DavidAnson.vscode-markdownlint
dbaeumer.jshint
dbaeumer.vscode-eslint
dbankier.vscode-quick-select
drKnoxy.eslint-disable-snippets
dsznajder.es7-react-js-snippets
eamodio.gitlens
eamodio.restore-editors
EditorConfig.EditorConfig
esbenp.prettier-vscode
formulahendry.auto-rename-tag
geddski.macros
gerane.Theme-TomorrowNightEighties
GitHub.copilot
GitHub.vscode-pull-request-github
GraphQL.vscode-graphql
HookyQR.beautify
IBM.output-colorizer
kaiwood.better-line-select
kisstkondoros.vscode-gutter-preview
kumar-harsh.graphql-for-vscode
lihui.vs-color-picker
mkaufman.HTMLHint
mrmlnc.vscode-json5
ms-azuretools.vscode-docker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-vscode.sublime-keybindings
ms-vscode.vscode-typescript-tslint-plugin
msjsdiag.debugger-for-chrome
naumovs.color-highlight
NuclleaR.vscode-extension-auto-import
oderwat.indent-rainbow
patbenatar.advanced-new-file
Prisma.prisma
sdras.night-owl
shardulm94.trailing-spaces
sidneys1.gitconfig
SirTori.indenticator
sleistner.vscode-fileutils
steoates.autoimport
streetsidesoftware.code-spell-checker
techer.open-in-browser
tomoki1207.pdf
ue.alphabetical-sorter
vincaslt.highlight-matching-tag
vscode-icons-team.vscode-icons
vscodevim.vim
wayou.vscode-todo-highlight
withfig.fig
wix.glean
wmaurer.change-case
xabikos.ReactSnippets
yzhang.markdown-all-in-one
Zignd.html-css-class-completion
