docker/cli
djui/alias-tips
mafredri/zsh-async
rupa/z
lukechilds/zsh-nvm
sindresorhus/pure
Tarrasch/zsh-bd
zsh-users/zsh-autosuggestions
zsh-users/zsh-completions
zsh-users/zsh-history-substring-search
zsh-users/zsh-syntax-highlighting
